roguesystem.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-02-22 Do 12:03 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Flying Fox Undocking Checklist</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="rs.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Flying Fox Undocking Checklist</h1>
</header>
<div id="outline-container-orgd0f6c71" class="outline-2">
<h2 id="orgd0f6c71">Cold Start</h2>
<div class="outline-text-2" id="text-orgd0f6c71">
</div>
<div id="outline-container-org24377af" class="outline-3">
<h3 id="org24377af">Preliminaries</h3>
<div class="outline-text-3" id="text-org24377af">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Buckle Up</li>
<li class="off"><input type='checkbox' /> Instrument Lights</li>
<li class="off"><input type='checkbox' /> Ensure throttles are zeroed</li>
</ul>
</div>
</div>
<div id="outline-container-org78e1068" class="outline-3">
<h3 id="org78e1068">Battery Systems</h3>
<div class="outline-text-3" id="text-org78e1068">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Enable Battery 1</li>
<li class="off"><input type='checkbox' /> Select Battery 1 (if necessary)</li>
<li class="off"><input type='checkbox' /> Tie Battery to System Bus 1</li>
<li class="off"><input type='checkbox' /> Confirm System Bus 1 has full power available</li>
<li class="off"><input type='checkbox' /> Confirm System Bus 1 indicator is green</li>
<li class="off"><input type='checkbox' /> Enable External Power</li>
<li class="off"><input type='checkbox' /> Confirm Battery 1 no longer losing power</li>
<li class="off"><input type='checkbox' /> Enable Battery 2</li>
<li class="off"><input type='checkbox' /> Select Battery 2</li>
<li class="off"><input type='checkbox' /> Tie Battery to System Bus 2</li>
<li class="off"><input type='checkbox' /> Confirm System Bus 2 has full power available</li>
<li class="off"><input type='checkbox' /> Confirm System Bus 2 indicator is green</li>
</ul>
</div>
</div>
<div id="outline-container-orgf7aaf0b" class="outline-3">
<h3 id="orgf7aaf0b">Fuel Cells</h3>
<div class="outline-text-3" id="text-orgf7aaf0b">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Enable Fuel Cell 1</li>
<li class="off"><input type='checkbox' /> Confirm Fuel Core Temp. is rising</li>
<li class="off"><input type='checkbox' /> Enable Fuel Cell 2</li>
<li class="off"><input type='checkbox' /> Select Fuel Cell 2</li>
<li class="off"><input type='checkbox' /> Confirm Fuel Core Temp. is rising</li>
</ul>
</div>
</div>
<div id="outline-container-org8f2badc" class="outline-3">
<h3 id="org8f2badc">Temperature Management</h3>
<div class="outline-text-3" id="text-org8f2badc">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Enable TMS</li>
<li class="off"><input type='checkbox' /> Select Cooling Loop 1 (if necessary)</li>
<li class="off"><input type='checkbox' /> Pressurize Coolant Tank Bladder</li>
<li class="off"><input type='checkbox' /> Confirm Tank Level decreases</li>
<li class="off"><input type='checkbox' /> Wait for Pressure &gt;= 100psi</li>
<li class="off"><input type='checkbox' /> Enable Coolant Circulation Pump</li>
<li class="off"><input type='checkbox' /> Confirm Pump stabilizes at 50%</li>
<li class="off"><input type='checkbox' /> Set Pump speed to NORM</li>
<li class="off"><input type='checkbox' /> Confirm Pump stabilizes at 92%</li>
<li class="off"><input type='checkbox' /> Enable Radiation-Balanced Laser Cooling</li>
<li class="off"><input type='checkbox' /> Select Cooling Loop 2</li>
<li class="off"><input type='checkbox' /> Pressurize Coolant Tank Bladder</li>
<li class="off"><input type='checkbox' /> Confirm Tank Level decreases</li>
<li class="off"><input type='checkbox' /> Wait for Pressure &gt;= 100psi</li>
<li class="off"><input type='checkbox' /> Enable Coolant Circulation Pump</li>
<li class="off"><input type='checkbox' /> Confirm Pump stabilizes at 50%</li>
<li class="off"><input type='checkbox' /> Set Pump speed to NORM</li>
<li class="off"><input type='checkbox' /> Confirm Pump stabilizes at 92%</li>
<li class="off"><input type='checkbox' /> Enable Radiation-Balanced Laser Cooling</li>
<li class="off"><input type='checkbox' /> Enable HVAC</li>
</ul>
</div>
</div>
<div id="outline-container-org2729355" class="outline-3">
<h3 id="org2729355">Traffic Control Check-In</h3>
<div class="outline-text-3" id="text-org2729355">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Enable COMMS System</li>
<li class="off"><input type='checkbox' /> Enable Transmitter</li>
<li class="off"><input type='checkbox' /> Check in with STC</li>
<li class="off"><input type='checkbox' /> Request Departure Clearance</li>
</ul>
</div>
</div>
<div id="outline-container-org419f06d" class="outline-3">
<h3 id="org419f06d">High Voltage Systems: Stage 1</h3>
<div class="outline-text-3" id="text-org419f06d">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Enable LENR Systems</li>
<li class="off"><input type='checkbox' /> Enable Core Heater</li>
<li class="off"><input type='checkbox' /> Verify LENR Core Temperature is rising</li>
<li class="off"><input type='checkbox' /> Enable RCM Systems</li>
<li class="off"><input type='checkbox' /> Pressurize Tank 1 Pressure Bladder</li>
<li class="off"><input type='checkbox' /> Pressurize Tank 2 Pressure Bladder</li>
<li class="off"><input type='checkbox' /> Pressurize Tank 3 Pressure Bladder</li>
<li class="off"><input type='checkbox' /> Pressurize Tank 4 Pressure Bladder</li>
<li class="off"><input type='checkbox' /> Ensure all tanks are pressurizing</li>
<li class="off"><input type='checkbox' /> Validate LENR Source Tank</li>
<li class="off"><input type='checkbox' /> Confirm LENR Reactant Tank 2 is selected</li>
<li class="off"><input type='checkbox' /> Select LENR Reactant Tank 4</li>
<li class="off"><input type='checkbox' /> Confirm LENR Reactant Tank 4 is selected</li>
<li class="off"><input type='checkbox' /> Select Fuel Cell 2 (if necessary)</li>
<li class="off"><input type='checkbox' /> Validate Fuel Cell 2</li>
<li class="off"><input type='checkbox' /> Set Purge Contaminants to Auto-On</li>
<li class="off"><input type='checkbox' /> Select Fuel Cell 1</li>
<li class="off"><input type='checkbox' /> Validate Fuel Cell 1</li>
<li class="off"><input type='checkbox' /> Set Purge Contaminants to Auto-On</li>
</ul>
</div>
</div>
<div id="outline-container-orge1d66c8" class="outline-3">
<h3 id="orge1d66c8">MFD and Navigation Setup</h3>
<div class="outline-text-3" id="text-orge1d66c8">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Enable VMS Displays</li>
<li class="off"><input type='checkbox' /> Switch to Aft Towing Camera (optional)</li>
<li class="off"><input type='checkbox' /> Enable External Docking Info Mode</li>
<li class="off"><input type='checkbox' /> Select EA/D Ports in MFD</li>
<li class="off"><input type='checkbox' /> Select Connected External Port</li>
<li class="off"><input type='checkbox' /> Set as Docking Target</li>
<li class="off"><input type='checkbox' /> Select Navigation in MFD</li>
<li class="off"><input type='checkbox' /> Enable NAS Systems</li>
<li class="off"><input type='checkbox' /> Confirm Navigation MFD is Populated</li>
<li class="off"><input type='checkbox' /> Select COMMS in MFD</li>
</ul>
</div>
</div>
<div id="outline-container-orgecafff6" class="outline-3">
<h3 id="orgecafff6">High Voltage Systems: Stage 2</h3>
<div class="outline-text-3" id="text-orgecafff6">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Confirm LENR Core Temperature is &gt;= 290F</li>
<li class="off"><input type='checkbox' /> Notify STC of LENR intiation</li>
<li class="off"><input type='checkbox' /> Await STC Clearance</li>
<li class="off"><input type='checkbox' /> Initiate LENR reaction</li>
<li class="off"><input type='checkbox' /> Confirm Main Power Bus has power available (wont be full)</li>
<li class="off"><input type='checkbox' /> Confirm ECS Main indicator is green</li>
<li class="off"><input type='checkbox' /> Tie Main Bus to System Bus 1</li>
<li class="off"><input type='checkbox' /> Tie Main Bus to System Bus 2</li>
<li class="off"><input type='checkbox' /> Tie Main Bus to Utility Bus</li>
<li class="off"><input type='checkbox' /> Disable External Power</li>
<li class="off"><input type='checkbox' /> Select Battery 2 (if necessary)</li>
<li class="off"><input type='checkbox' /> Allow Battery Charging</li>
<li class="off"><input type='checkbox' /> Verify Battery is charging</li>
<li class="off"><input type='checkbox' /> Select Battery 1</li>
<li class="off"><input type='checkbox' /> Allow Battery Charging</li>
<li class="off"><input type='checkbox' /> Verify Battery is charging</li>
</ul>
</div>
</div>
<div id="outline-container-orgb316362" class="outline-3">
<h3 id="orgb316362">Maneuvering Systems: Stage 1</h3>
<div class="outline-text-3" id="text-orgb316362">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Enable MTS Systems</li>
<li class="off"><input type='checkbox' /> Validate Propellant</li>
<li class="off"><input type='checkbox' /> Confirm Tank 1 is selected</li>
<li class="off"><input type='checkbox' /> Enable Propellant Injector</li>
</ul>
</div>
</div>
<div id="outline-container-org4d0be53" class="outline-3">
<h3 id="org4d0be53">External Lights</h3>
<div class="outline-text-3" id="text-org4d0be53">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Enable Docking Lights</li>
<li class="off"><input type='checkbox' /> Enable External Flood Lights</li>
<li class="off"><input type='checkbox' /> Enable Navigation Lights</li>
</ul>
</div>
</div>
<div id="outline-container-org41a13d9" class="outline-3">
<h3 id="org41a13d9">Undocking</h3>
<div class="outline-text-3" id="text-org41a13d9">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Notify STC that you are ready for departure</li>
<li class="off"><input type='checkbox' /> Tune Channel 2 to provided departure frequency</li>
<li class="off"><input type='checkbox' /> Tune Channel 3 to provided localizer frequency</li>
<li class="off"><input type='checkbox' /> Await undocking</li>
<li class="off"><input type='checkbox' /> Maneuver to 200m from the station</li>
<li class="off"><input type='checkbox' /> Disable Docking Lights</li>
</ul>
</div>
</div>
<div id="outline-container-org516b982" class="outline-3">
<h3 id="org516b982">Maneuvering Systems: Stage 2</h3>
<div class="outline-text-3" id="text-org516b982">
<ul class="org-ul">
<li class="off"><input type='checkbox' /> Enable Superconductor</li>
<li class="off"><input type='checkbox' /> Enable Helicon Coupler</li>
<li class="off"><input type='checkbox' /> Wait for Magnetic Containment Field to reach safe levels</li>
<li class="off"><input type='checkbox' /> Press and hold MTS Ignition</li>
<li class="off"><input type='checkbox' /> Wait for Plasma Core Temperature to stabilize (red)</li>
<li class="off"><input type='checkbox' /> Enable Ion Cyclotron Heater</li>
<li class="off"><input type='checkbox' /> Wait for Plasma Core Temperature to stabilize (blue)</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-02-22 Do 12:03</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
